rudn_data = {'01.03.01 | Бакалавриат - Математика': [{   'budget_places': {'40'},
        'mid_entry_score': {'217'},
        'mid_score': {'248'},
        'subjects': {   'ИКТ',
                        'Математика',
                        'Русский язык',
                        'Физика'}}],

 '01.03.02 | Бакалавриат - Прикладная математика и информатика': [{   'budget_places': {'39'},
        'mid_entry_score': {'217'},
        'mid_score': {'248'},
        'subjects': {   'ИКТ',
                        'Математика',
                        'Русский язык',
                        'Физика'}},
    {   'budget_places': {'Нет данных'},
        'mid_entry_score': {   'Только '
                               'платное'},
        'mid_score': {'254'},
        'subjects': {   'ИКТ',
                        'Математика',
                        'Русский язык',
                        'Физика'}}],

 '02.03.01 | Бакалавриат - Математика и компьютерные науки': [{   'budget_places': {'46'},
        'mid_entry_score': {'218'},
        'mid_score': {'249'},
        'subjects': {   'ИКТ',
                        'Математика',
                        'Русский язык',
                        'Физика'}}],

 '02.03.02 | Бакалавриат - Фундаментальная информатика и информационные технологии': [{'budget_places': {'Нет данных'},
        'mid_entry_score': {   'Только '
                               'платное'},
        'mid_score': {'290'},
        'subjects': {   'ИКТ',
                        'Математика',
                        'Русский язык',
                        'Физика'}},
    {   'budget_places': {'45'},
        'mid_entry_score': {'218'},
        'mid_score': {'249'},
        'subjects': {   'ИКТ',
                        'Математика',
                        'Русский язык',
                        'Физика'}}],

 '03.03.02 | Бакалавриат - Физика': [   {   'budget_places': {'25'},
        'mid_entry_score': {'213'},
        'mid_score': {'236'},
        'subjects': {   'ИКТ',
                        'Математика',
                        'Русский язык',
                        'Физика'}}],

 '04.03.01 | Бакалавриат - Химия': [   {   'budget_places': {'45'},
        'mid_entry_score': {'245'},
        'mid_score': {'271'},
        'subjects': {   'ИКТ',
                        'Математика',
                        'Русский язык',
                        'Химия'}}],

 '05.03.06 | Бакалавриат - Экология и природопользование': [{   'budget_places': {'55'},
        'mid_entry_score': {'160'},
        'mid_score': {'219'},
        'subjects': {   'География',
                        'ИКТ',
                        'Математика',
                        'Русский '
                        'язык'}},
    {   'budget_places': {'30'},
        'mid_entry_score': {'214'},
        'mid_score': {'239'},
        'subjects': {   'Биология',
                        'ИКТ',
                        'Математика',
                        'Русский '
                        'язык'}}],

 '06.03.01 | Бакалавриат - Биология': [{'budget_places': {'Нет данных'},
                                                'mid_entry_score': {'Только '
                                                                    'платное'},
                                                'mid_score': {'Нет данных'},
                                                'subjects': {'Биология',
                                                             'Русский язык',
                                                             'Химия'}}],
 '06.05.01 | Специалитет - Биоинженерия и биоинформатика': [{'budget_places': {'Нет данных'},
                                                             'mid_entry_score': {'Только '
                                                                                  'платное'},
                                                              'mid_score': {'Нет '
                                                                            'данных'},
                                                              'subjects': {'Биология',
                                                                           'ИКТ',
                                                                           'Математика',
                                                                           'Русский '
                                                                           'язык',
                                                                           'Физика',
                                                                           'Химия'}}],

 '07.03.01 | Бакалавриат - Архитектура': [{'budget_places': {'47'},
                                                      'mid_entry_score': {'170'},
                                                      'mid_score': {'188'},
                                                      'subjects': {'Внутренний '
                                                                   'экзамен(ы)',
                                                                   'Математика',
                                                                   'Русский '
                                                                   'язык'}}],

 '08.03.01 | Бакалавриат - Строительство': [{'budget_places': {'50'},
                                                          'mid_entry_score': {'230'},
                                                          'mid_score': {'244'},
                                                          'subjects': {'Математика',
                                                                       'Русский '
                                                                       'язык',
                                                                       'Физика'}}],

 '09.03.03 | Бакалавриат - Прикладная информатика': [{'budget_places': {'27'},
                                                        'mid_entry_score': {'253'},
                                                        'mid_score': {'268'},
                                                        'subjects': {'ИКТ',
                                                                     'Математика',
                                                                     'Русский '
                                                                     'язык',
                                                                     'Физика'}},
                                                       {'budget_places': {'24'},
                                                        'mid_entry_score': {'233'},
                                                        'mid_score': {'246'},
                                                        'subjects': {'ИКТ',
                                                                     'Математика',
                                                                     'Русский '
                                                                     'язык',
                                                                     'Физика'}}],

 '13.03.03 | Бакалавриат - Энергетическое машиностроение': [{'budget_places': {'40'},
                                                                      'mid_entry_score': {'198'},
                                                                      'mid_score': {'209'},
                                                                      'subjects': {'Математика',
                                                                                   'Русский '
                                                                                   'язык',
                                                                                   'Физика',
                                                                                   'Химия'}}],

 '15.03.05 | Бакалавриат - Конструкторско-технологическое обеспечение машиностроительных производств': [{'budget_places': {'40'},
                                                                                                                  'mid_entry_score': {'200'},
                                                                                                                  'mid_score': {'223'},
                                                                                                                  'subjects': {'ИКТ',
                                                                                                                               'Математика',
                                                                                                                               'Русский '
                                                                                                                               'язык',
                                                                                                                               'Физика'}}],

 '18.03.02 | Бакалавриат - Энерго- и ресурсосберегающие процессы в химической технологии, нефтехимии и биотехнологии': [{'budget_places': {'25'},
                                                                                                                                      'mid_entry_score': {'184'},
                                                                                                                                      'mid_score': {'231'},
                                                                                                                                      'subjects': {'ИКТ',
                                                                                                                                                   'Математика',
                                                                                                                                                   'Русский '
                                                                                                                                                   'язык',
                                                                                                                                                   'Физика',
                                                                                                                                                   'Химия'}}],

 '21.03.01 | Бакалавриат - Нефтегазовое дело': [{'budget_places': {'28'},
                                                                  'mid_entry_score': {'229'},
                                                                  'mid_score': {'255'},
                                                                  'subjects': {'Математика',
                                                                               'Русский '
                                                                               'язык',
                                                                               'Физика',
                                                                               'Химия'}}],

 '21.03.02 | Бакалавриат - Землеустройство и кадастры': [{'budget_places': {'43'},
                                                                    'mid_entry_score': {'208'},
                                                                    'mid_score': {'230'},
                                                                    'subjects': {'География',
                                                                                 'ИКТ',
                                                                                 'Математика',
                                                                                 'Русский '
                                                                                 'язык',
                                                                                 'Физика',
                                                                                 'Химия'}}],

 '21.05.02 | Специалитет - Прикладная геология': [{'budget_places': {'28'},
                                                                      'mid_entry_score': {'203'},
                                                                      'mid_score': {'226'},
                                                                      'subjects': {'ИКТ',
                                                                                   'Математика',
                                                                                   'Русский '
                                                                                   'язык',
                                                                                   'Физика'}}],

 '21.05.04 | Специалитет - Горное дело': [{'budget_places': {'27'},
                                                      'mid_entry_score': {'203'},
                                                      'mid_score': {'226'},
                                                      'subjects': {'Математика',
                                                                   'Русский '
                                                                   'язык',
                                                                   'Физика',
                                                                   'Химия'}}],

 '23.03.03 | Бакалавриат - Эксплуатация транспортно-технологических машин и комплексов': [{'budget_places': {'40'},
                                                                                                  'mid_entry_score': {'203'},
                                                                                                  'mid_score': {'165'},
                                                                                                  'subjects': {'ИКТ',
                                                                                                               'Математика',
                                                                                                               'Русский '
                                                                                                               'язык',
                                                                                                               'Физика'}}],

 '27.03.01 | Бакалавриат - Стандартизация и метрология': [{'budget_places': {'22'},
                                                              'mid_entry_score': {'185'},
                                                              'mid_score': {'214'},
                                                              'subjects': {'ИКТ',
                                                                           'Математика',
                                                                           'Русский '
                                                                           'язык',
                                                                           'Физика',
                                                                           'Химия'}}],

 '27.03.04 | Бакалавриат - Управление в технических системах': [{'budget_places': {'34'},
                                                                      'mid_entry_score': {'238'},
                                                                      'mid_score': {'257'},
                                                                      'subjects': {'ИКТ',
                                                                                   'Математика',
                                                                                   'Русский '
                                                                                   'язык',
                                                                                   'Физика'}}],

 '27.03.05 | Бакалавриат - Инноватика': [{'budget_places': {'30'},
                                                    'mid_entry_score': {'237'},
                                                    'mid_score': {'255'},
                                                    'subjects': {'ИКТ',
                                                                 'Математика',
                                                                 'Русский язык',
                                                                 'Физика'}}],

 '28.03.02 | Бакалавриат - Наноинженерия': [{'budget_places': {'40'},
                                                      'mid_entry_score': {'210'},
                                                      'mid_score': {'233'},
                                                      'subjects': {'ИКТ',
                                                                   'Математика',
                                                                   'Русский '
                                                                   'язык',
                                                                   'Физика'}}],

 '31.05.01 | Специалитет - Лечебное дело': [{'budget_places': {'25'},
                                                          'mid_entry_score': {'282'},
                                                          'mid_score': {'290'},
                                                          'subjects': {'Биология',
                                                                       'Русский '
                                                                       'язык',
                                                                       'Химия'}}],

 '31.05.03 | Специалитет - Стоматология': [{'budget_places': {'2'},
                                                        'mid_entry_score': {'300'},
                                                        'mid_score': {'Нет '
                                                                      'данных'},
                                                        'subjects': {'Биология',
                                                                     'Русский '
                                                                     'язык',
                                                                     'Химия'}}],

 '33.05.01 | Специалитет - Фармация': [{'budget_places': {'25'},
                                                'mid_entry_score': {'243'},
                                                'mid_score': {'261'},
                                                'subjects': {'Биология',
                                                             'Русский язык',
                                                             'Химия'}}],

 '34.03.01 | Бакалавриат - Сестринское дело': [{'budget_places': {'9'},
                                                                'mid_entry_score': {'213'},
                                                                'mid_score': {'230'},
                                                                'subjects': {'Биология',
                                                                             'Русский '
                                                                             'язык',
                                                                             'Химия'}}],

 '35.03.04 | Бакалавриат - Агрономия': [{'budget_places': {'20'},
                                                  'mid_entry_score': {'205'},
                                                  'mid_score': {'238'},
                                                  'subjects': {'Биология',
                                                               'География',
                                                               'ИКТ',
                                                               'Математика',
                                                               'Русский язык',
                                                               'Физика',
                                                               'Химия'}}],

 '35.03.10 | Бакалавриат - Ландшафтная архитектура': [{'budget_places': {'33'},
                                                              'mid_entry_score': {'227'},
                                                              'mid_score': {'251'},
                                                              'subjects': {'Биология',
                                                                           'География',
                                                                           'ИКТ',
                                                                           'Математика',
                                                                           'Русский '
                                                                           'язык',
                                                                           'Физика',
                                                                           'Химия'}}],

 '36.03.01 | Бакалавриат - Ветеринарно-санитарная экспертиза': [{'budget_places': {'20'},
                                                                          'mid_entry_score': {'184'},
                                                                          'mid_score': {'218'},
                                                                          'subjects': {'Биология',
                                                                                       'Математика',
                                                                                       'Русский '
                                                                                       'язык',
                                                                                       'Химия'}}],

 '36.05.01 | Специалитет - Ветеринария': [{'budget_places': {'30'},
                                                      'mid_entry_score': {'231'},
                                                      'mid_score': {'260'},
                                                      'subjects': {'Биология',
                                                                   'Математика',
                                                                   'Русский '
                                                                   'язык',
                                                                   'Химия'}}],

 '37.03.01 | Бакалавриат - Психология': [{'budget_places': {'40'},
                                                    'mid_entry_score': {'215'},
                                                    'mid_score': {'253'},
                                                    'subjects': {'Биология',
                                                                 'Математика',
                                                                 'Обществознание',
                                                                 'Русский '
                                                                 'язык'}}],

 '37.05.01 | Специалитет - Клиническая психология': [{'budget_places': {'Нет '
                                                                          'данных'},
                                                        'mid_entry_score': {'Только '
                                                                            'платное'},
                                                        'mid_score': {'Нет '
                                                                      'данных'},
                                                        'subjects': {'Биология',
                                                                     'Математика',
                                                                     'Обществознание',
                                                                     'Русский '
                                                                     'язык',
                                                                     'Химия'}}],

 '38.03.01 | Бакалавриат - Экономика': [{'budget_places': {'5'},
                                                  'mid_entry_score': {'300'},
                                                  'mid_score': {'80%'},
                                                  'subjects': {'География',
                                                               'ИКТ',
                                                               'Иностранный '
                                                               'язык',
                                                               'История',
                                                               'Математика',
                                                               'Обществознание',
                                                               'Русский язык'}},
                                                 {'budget_places': {'9'},
                                                  'mid_entry_score': {'300'},
                                                  'mid_score': {'Нет данных'},
                                                  'subjects': {'География',
                                                               'ИКТ',
                                                               'Иностранный '
                                                               'язык',
                                                               'История',
                                                               'Математика',
                                                               'Обществознание',
                                                               'Русский язык'}},
                                                 {'budget_places': {'Нет '
                                                                    'данных'},
                                                  'mid_entry_score': {'Только '
                                                                      'платное'},
                                                  'mid_score': {'Нет данных'},
                                                  'subjects': {'География',
                                                               'ИКТ',
                                                               'Иностранный '
                                                               'язык',
                                                               'История',
                                                               'Математика',
                                                               'Обществознание',
                                                               'Русский язык'}},
                                                 {'budget_places': {'Нет '
                                                                    'данных'},
                                                  'mid_entry_score': {'Только '
                                                                      'платное'},
                                                  'mid_score': {'Нет данных'},
                                                  'subjects': {'География',
                                                               'ИКТ',
                                                               'Иностранный '
                                                               'язык',
                                                               'История',
                                                               'Математика',
                                                               'Обществознание',
                                                               'Русский '
                                                               'язык'}}],
 '38.03.02 | Бакалавриат - Менеджмент': [{'budget_places': {'5'},
                                                    'mid_entry_score': {'300'},
                                                    'mid_score': {'40%'},
                                                    'subjects': {'ИКТ',
                                                                 'Иностранный '
                                                                 'язык',
                                                                 'История',
                                                                 'Математика',
                                                                 'Обществознание',
                                                                 'Русский '
                                                                 'язык'}},
                                                   {'budget_places': {'Нет '
                                                                      'данных'},
                                                    'mid_entry_score': {'Только '
                                                                        'платное'},
                                                    'mid_score': {'Нет данных'},
                                                    'subjects': {'ИКТ',
                                                                 'Иностранный '
                                                                 'язык',
                                                                 'История',
                                                                 'Математика',
                                                                 'Обществознание',
                                                                 'Русский '
                                                                 'язык'}},
                                                   {'budget_places': {'Нет '
                                                                      'данных'},
                                                    'mid_entry_score': {'Только '
                                                                        'платное'},
                                                    'mid_score': {'Нет данных'},
                                                    'subjects': {'ИКТ',
                                                                 'Иностранный '
                                                                 'язык',
                                                                 'Математика',
                                                                 'Русский '
                                                                 'язык'}},
                                                   {'budget_places': {'8'},
                                                    'mid_entry_score': {'258'},
                                                    'mid_score': {'258'},
                                                    'subjects': {'ИКТ',
                                                                 'Иностранный '
                                                                 'язык',
                                                                 'История',
                                                                 'Математика',
                                                                 'Обществознание',
                                                                 'Русский '
                                                                 'язык'}}],

 '38.03.04 | Бакалавриат - Государственное и муниципальное управление': [{'budget_places': {'10'},
                                                                                'mid_entry_score': {'300'},
                                                                                'mid_score': {'60%'},
                                                                                'subjects': {'Иностранный '
                                                                                             'язык',
                                                                                             'История',
                                                                                             'Математика',
                                                                                             'Обществознание',
                                                                                             'Русский '
                                                                                             'язык'}}],
 '38.03.05 | Бакалавриат - Бизнес-информатика': [{'budget_places': {'Нет '
                                                                                      'данных'},
                                                                    'mid_entry_score': {'Только '
                                                                                        'платное'},
                                                                    'mid_score': {'Нет '
                                                                                  'данных'},
                                                                    'subjects': {'ИКТ',
                                                                                 'История',
                                                                                 'Математика',
                                                                                 'Обществознание',
                                                                                 'Русский '
                                                                                 'язык'}},
                                                                   {'budget_places': {'5'},
                                                                    'mid_entry_score': {'300'},
                                                                    'mid_score': {'20%'},
                                                                    'subjects': {'ИКТ',
                                                                                 'История',
                                                                                 'Математика',
                                                                                 'Обществознание',
                                                                                 'Русский '
                                                                                 'язык'}}],
 '38.05.01 | Специалитет - Экономическая безопасность': [{'budget_places': {'15'},
                                                                    'mid_entry_score': {'255'},
                                                                    'mid_score': {'271'},
                                                                    'subjects': {'ИКТ',
                                                                                 'История',
                                                                                 'Математика',
                                                                                 'Обществознание',
                                                                                 'Русский '
                                                                                 'язык'}}],
 '38.05.02 | Специалитет - Таможенное дело': [{'budget_places': {'10'},
                                                      'mid_entry_score': {'288'},
                                                      'mid_score': {'291'},
                                                      'subjects': {'География',
                                                                   'ИКТ',
                                                                   'Иностранный '
                                                                   'язык',
                                                                   'Обществознание',
                                                                   'Русский '
                                                                   'язык'}}],
 '39.03.01 | Бакалавриат - Социология': [{'budget_places': {'30'},
                                                    'mid_entry_score': {'258'},
                                                    'mid_score': {'271'},
                                                    'subjects': {'Иностранный '
                                                                 'язык',
                                                                 'История',
                                                                 'Математика',
                                                                 'Обществознание',
                                                                 'Русский '
                                                                 'язык'}}],
 '40.03.01 | Бакалавриат - Юриспруденция': [{'budget_places': {'Нет '
                                                                            'данных'},
                                                          'mid_entry_score': {'Только '
                                                                              'платное'},
                                                          'mid_score': {'Нет '
                                                                        'данных'},
                                                          'subjects': {'ИКТ',
                                                                       'Иностранный '
                                                                       'язык',
                                                                       'История',
                                                                       'Обществознание',
                                                                       'Русский '
                                                                       'язык'}},
                                                         {'budget_places': {'24'},
                                                          'mid_entry_score': {'278'},
                                                          'mid_score': {'284'},
                                                          'subjects': {'ИКТ',
                                                                       'Иностранный '
                                                                       'язык',
                                                                       'История',
                                                                       'Обществознание',
                                                                       'Русский '
                                                                       'язык'}},
                                                         {'budget_places': {'Нет '
                                                                            'данных'},
                                                          'mid_entry_score': {'Только '
                                                                              'платное'},
                                                          'mid_score': {'Нет '
                                                                        'данных'},
                                                          'subjects': {'ИКТ',
                                                                       'Иностранный '
                                                                       'язык',
                                                                       'История',
                                                                       'Обществознание',
                                                                       'Русский '
                                                                       'язык'}},
                                                         {'budget_places': {'Нет '
                                                                            'данных'},
                                                          'mid_entry_score': {'Только '
                                                                              'платное'},
                                                          'mid_score': {'Нет '
                                                                        'данных'},
                                                          'subjects': {'ИКТ',
                                                                       'Иностранный '
                                                                       'язык',
                                                                       'История',
                                                                       'Обществознание',
                                                                       'Русский '
                                                                       'язык'}}],
 '41.03.01 | Бакалавриат - Зарубежное регионоведение': [{'budget_places': {'10'},
                                                                                  'mid_entry_score': {'260'},
                                                                                  'mid_score': {'272'},
                                                                                  'subjects': {'География',
                                                                                               'Иностранный '
                                                                                               'язык',
                                                                                               'История',
                                                                                               'Обществознание',
                                                                                               'Русский '
                                                                                               'язык'}},
                                                                                 {'budget_places': {'10'},
                                                                                  'mid_entry_score': {'233'},
                                                                                  'mid_score': {'252'},
                                                                                  'subjects': {'География',
                                                                                               'Иностранный '
                                                                                               'язык',
                                                                                               'История',
                                                                                               'Обществознание',
                                                                                               'Русский '
                                                                                               'язык'}},
                                                                                 {'budget_places': {'8'},
                                                                                  'mid_entry_score': {'249'},
                                                                                  'mid_score': {'261'},
                                                                                  'subjects': {'География',
                                                                                               'Иностранный '
                                                                                               'язык',
                                                                                               'История',
                                                                                               'Обществознание',
                                                                                               'Русский '
                                                                                               'язык'}}],
 '41.03.04 | Бакалавриат - Политология': [{'budget_places': {'10'},
                                                      'mid_entry_score': {'260'},
                                                      'mid_score': {'272'},
                                                      'subjects': {'География',
                                                                   'Иностранный '
                                                                   'язык',
                                                                   'История',
                                                                   'Обществознание',
                                                                   'Русский '
                                                                   'язык'}}],
 '41.03.05 | Бакалавриат - Международные отношения': [{'budget_places': {'20'},
                                                                              'mid_entry_score': {'270'},
                                                                              'mid_score': {'282'},
                                                                              'subjects': {'География',
                                                                                           'ИКТ',
                                                                                           'Иностранный '
                                                                                           'язык',
                                                                                           'История',
                                                                                           'Математика',
                                                                                           'Обществознание',
                                                                                           'Русский '
                                                                                           'язык'}}],
 '42.03.01 | Бакалавриат - Реклама и связи с общественностью': [{'budget_places': {'20'},
                                                                                                  'mid_entry_score': {'289'},
                                                                                                  'mid_score': {'291'},
                                                                                                  'subjects': {'ИКТ',
                                                                                                               'Иностранный '
                                                                                                               'язык',
                                                                                                               'История',
                                                                                                               'Литература',
                                                                                                               'Обществознание',
                                                                                                               'Русский '
                                                                                                               'язык'}},
                                                                                                 {'budget_places': {'30'},
                                                                                                  'mid_entry_score': {'286'},
                                                                                                  'mid_score': {'288'},
                                                                                                  'subjects': {'ИКТ',
                                                                                                               'Иностранный '
                                                                                                               'язык',
                                                                                                               'История',
                                                                                                               'Литература',
                                                                                                               'Обществознание',
                                                                                                               'Русский '
                                                                                                               'язык'}},
                                                                                                 {'budget_places': {'Нет '
                                                                                                                    'данных'},
                                                                                                  'mid_entry_score': {'Только '
                                                                                                                      'платное'},
                                                                                                  'mid_score': {'Нет '
                                                                                                                'данных'},
                                                                                                  'subjects': {'ИКТ',
                                                                                                               'Иностранный '
                                                                                                               'язык',
                                                                                                               'История',
                                                                                                               'Литература',
                                                                                                               'Обществознание',
                                                                                                               'Русский '
                                                                                                               'язык'}}],
 '42.03.02 | Бакалавриат - Журналистика': [{'budget_places': {'33'},
                                                        'mid_entry_score': {'156'},
                                                        'mid_score': {'181'},
                                                        'subjects': {'Внутренний '
                                                                     'экзамен(ы)',
                                                                     'Литература',
                                                                     'Русский '
                                                                     'язык'}}],
 '42.03.04 | Бакалавриат - Телевидение': [{'budget_places': {'10'},
                                                      'mid_entry_score': {'172'},
                                                      'mid_score': {'183'},
                                                      'subjects': {'Внутренний '
                                                                   'экзамен(ы)',
                                                                   'Литература',
                                                                   'Русский '
                                                                   'язык'}}],
 '43.03.02 | Бакалавриат - Туризм': [{'budget_places': {'1'},
                                            'mid_entry_score': {'NEW'},
                                            'mid_score': {'263'},
                                            'subjects': {'География',
                                                         'Иностранный язык',
                                                         'История',
                                                         'Обществознание',
                                                         'Русский язык'}}],
 '43.03.03 | Бакалавриат - Гостиничное дело': [{'budget_places': {'1'},
                                                                'mid_entry_score': {'276'},
                                                                'mid_score': {'284'},
                                                                'subjects': {'География',
                                                                             'Иностранный '
                                                                             'язык',
                                                                             'История',
                                                                             'Обществознание',
                                                                             'Русский '
                                                                             'язык'}},
                                                               {'budget_places': {'Нет '
                                                                                  'данных'},
                                                                'mid_entry_score': {'Только '
                                                                                    'платное'},
                                                                'mid_score': {'Нет '
                                                                              'данных'},
                                                                'subjects': {'География',
                                                                             'Иностранный '
                                                                             'язык',
                                                                             'История',
                                                                             'Обществознание',
                                                                             'Русский '
                                                                             'язык'}}],
 '44.03.02 | Бакалавриат - Психолого-педагогическое образование': [{'budget_places': {'10'},
                                                                                                        'mid_entry_score': {'217'},
                                                                                                        'mid_score': {'233'},
                                                                                                        'subjects': {'Биология',
                                                                                                                     'Математика',
                                                                                                                     'Обществознание',
                                                                                                                     'Русский '
                                                                                                                     'язык'}}],
 '45.03.01 | Бакалавриат - Филология': [{'budget_places': {'10'},
                                                  'mid_entry_score': {'280'},
                                                  'mid_score': {'288'},
                                                  'subjects': {'Иностранный '
                                                               'язык',
                                                               'История',
                                                               'Литература',
                                                               'Обществознание',
                                                               'Русский язык'}},
                                                 {'budget_places': {'15'},
                                                  'mid_entry_score': {'268'},
                                                  'mid_score': {'274'},
                                                  'subjects': {'Иностранный '
                                                               'язык',
                                                               'История',
                                                               'Литература',
                                                               'Обществознание',
                                                               'Русский '
                                                               'язык'}}],
 '45.03.02 | Бакалавриат - Лингвистика': [{'budget_places': {'12'},
                                                      'mid_entry_score': {'272'},
                                                      'mid_score': {'285'},
                                                      'subjects': {'Иностранный '
                                                                   'язык',
                                                                   'История',
                                                                   'Литература',
                                                                   'Обществознание',
                                                                   'Русский '
                                                                   'язык'}},
                                                     {'budget_places': {'12'},
                                                      'mid_entry_score': {'297'},
                                                      'mid_score': {'300'},
                                                      'subjects': {'Иностранный '
                                                                   'язык',
                                                                   'История',
                                                                   'Литература',
                                                                   'Обществознание',
                                                                   'Русский '
                                                                   'язык'}}],
 '45.03.04 | Бакалавриат - Интеллектуальные системы в гуманитарной сфере': [{'budget_places': {'10'},
                                                                                                                          'mid_entry_score': {'300'},
                                                                                                                          'mid_score': {'40%'},
                                                                                                                          'subjects': {'ИКТ',
                                                                                                                                       'Иностранный '
                                                                                                                                       'язык',
                                                                                                                                       'Математика',
                                                                                                                                       'Обществознание',
                                                                                                                                       'Русский '
                                                                                                                                       'язык'}}],
 '46.03.01 | Бакалавриат - История': [],
 '47.03.01 | Бакалавриат - Философия': [],
 '47.03.03 | Бакалавриат - Религиоведение': [],
 '50.03.01 | Бакалавриат - Искусства и гуманитарные науки': [{'budget_places': {'6'},
                                                                                            'mid_entry_score': {'265'},
                                                                                            'mid_score': {'268'},
                                                                                            'subjects': {'Иностранный '
                                                                                                         'язык',
                                                                                                         'История',
                                                                                                         'Литература',
                                                                                                         'Обществознание',
                                                                                                         'Русский '
                                                                                                         'язык'}}],
 '58.03.01 | Бакалавриат - Востоковедение и африканистика': [{'budget_places': {'Нет '
                                                                                                              'данных'},
                                                                                            'mid_entry_score': {'Только '
                                                                                                                'платное'},
                                                                                            'mid_score': {'Нет '
                                                                                                          'данных'},
                                                                                            'subjects': {'География',
                                                                                                         'Иностранный '
                                                                                                         'язык',
                                                                                                         'История',
                                                                                                         'Обществознание',
                                                                                                         'Русский '
                                                                                                         'язык'}}]}

msu_data = {}




universities_registry = [

    {
        "city": "Москва",
        "name": "Российский университет дружбы народов",
        "slug": "rudn",
        "data": rudn_data
    },
    {
        "city": "Москва",
        "name": "Московский государственный университет",
        "slug": "msu",
        "data": msu_data
    },
    {
        "city": "altayskykray",
        "name": "Алтайский государственный университет",
        "slug":"altsu",
        "data": altsu_data,
    },
    {
        "city": "altayskykray",
        "name": "Алтайский государственный педагогический университет",
        "slug":"altspu",
        "data":"altspu_data",
    },
    {
        'city': 'altayskykray',
        'name': 'Алтайский государственный технический университет имени И. И. Ползунова',
        'slug':'altstu',
        'data':altstu_data,
    },
    {'  city': 'altayskykray',
        'name': 'Алтайский государственный медицинский университет',
        'slug':'asmu',
        'data':asmu_data,
     },
    {
        'city': 'altayskykray',
        'name': 'Алтайский государственный гуманитарно-педагогический университет имени В.М. Шукшина',
        'slug':'bigpibiysk',
        'data':bigpibiysk_data,
    },
    {
        'city': 'altayskykray',
        'name': 'Алтайский государственный аграрный университет',
        'slug':'asau',
        'data':asau_data,

    },
    {
        'city': 'altayskykray',
        'name': 'Алтайский государственный институт культуры',
        'slug':'altgaki',
        'data':altgaki_data,
    },
    {
        'city': 'altayskykray',
        'name': 'Бийский технологический институт (филиал) Алтайского государственного технического университета имени И. И. Ползунова',
        'slug':'btisecna',
        'data':btisecna_data,
    },
    {
        'city': 'altayskykray',
        'name': 'Рубцовский индустриальный институт (филиал) Алтайского государственного технического университета имени И. И. Ползунова',
        'slug':'rubinst',
        'data':rubinst_data,
    },
    {
        'city': 'altayskykray',
        'name': 'Алтайский филиал Финансового Университета при Правительстве Российской Федерации',
        'slug':'fa_barnaul',
        'data':fa_barnaul_data,
    },
    {
        'city': 'altayskykray',
        'name': 'Рубцовский институт (филиал) Алтайского государственного университета',
        'slug':'rb_asu',
        'data':rb_asu_data,
    },
    {
        'city': 'altayskykray',
        'name': 'Филиал Алтайского государственного университета в г. Белокурихе',
        'slug':'belokur_asu',
        'data':belokur_asu_data,
    },
    {
        'city': 'altayskykray',
        'name': 'Филиал Алтайского государственного университета в г. Бийске',
        'slug':'biysk_asu',
        'data':biysk_asu_data,
    },
    {
        'city': 'altayskykray',
        'name': 'Бийский филиал Алтайского государственного педагогического университета им. В. М. Шукшина',
        'slug':'biysk.altspu',
        'data':biysk.altspu_data,
    }
    
    # ... сюда добавляем все 100 вузов ...
]